[
  {
    "id": 1,
    "name": "Crown-of-thorns",
    "botanical-name": "Euphorbia Milli",
    "location": ["Stairs"],
    "info": "Crown of thorns is a hardy perennial with stout gray thorns and oval leaves that drop as they age. The sprawling, branching, vinelike stems can attain lengths of more than two metres (seven feet), though potted plants are considerably smaller. The small inconspicuous flowers are borne in paired clusters and are surrounded by two showy light red bracts (leaflike structures attached just below flowers). Various forms are available with yellow or deep red bracts. The white milky sap is poisonous and can cause skin and eye irritation."
  },
  {
    "id": 2,
    "name": "Chinese Evergreen",
    "botanical-name": "Aglaonema commutatum",
    "location": ["Stairs"],
    "info": "Chinese evergreen is not a needled conifer, but rather a tropical perennial available in several cultivars that make excellent houseplants. They all have large, narrow, and glossy oval leaves on short stems, and flowers (on older plants) that bloom in spring or summer. The Chinese evergreen is one of the most popular houseplants and its color variations—from dark green and silver to red—add personality to your home's decor."
  },
  {
    "id": 3,
    "name": "Ti",
    "botanical-name": "Cordyline Terminalis",
    "location": ["Stairs", "Old Canteen", "Basketball Court", "Church"],
    "info": "Ti is a palm-like plant growing up to 4.5 metres (15 feet) tall with an attractive fan-like and spirally arranged cluster of broadly elongated leaves at the tip of the slender trunk. The leaves range from red to green and variegated forms. It is a woody plant with leaves 30–60 centimetres (12–24 inches) (rarely 75 cm or 30 in) long and 5–10 cm (2–4 in) wide at the top of a woody stem. It produces 40–60 cm (16–24 in) long panicles of small scented yellowish to red flowers that mature into red berries."
  },
  {
    "id": 4,
    "name": "Areca Palm",
    "botanical-name": "Dypsis Lutescens",
    "location": ["Stairs", "Physics Lab", "Church"],
    "info": "An Areca Palm plant is a tropical indoor plant that is popular for its lush, green foliage and air-purifying properties. It is also known as Dypsis lutescens.Once an endangered species, the Areca Palm is a staple in Indian spaces. One of the most undervalued plants in the indoor plant category. This excellent air purifier is pet friendly and easy to grow. Its delicate leaves/fronds grow outwards in a curved manner and add a tropical feel to any space and can adapt to a variety of growing conditions."
  },
  {
    "id": 5,
    "name": "Egyptian Star Cluster",
    "botanical-name": "Pentas Lanceolata",
    "location": ["Stairs"],
    "info": "Pentas are a tropical import, and grow wild in East Africa. Plants are just the right size for the middle of the summer border: the average height of pentas is 24–36 inches, but plants that perennialize in frost-free zones may reach four feet tall or greater.Blossom colors include pink, purple, white, and red. Penta plants can stay in bloom continuously under ideal growing conditions, so it's worth a bit of weekly care to keep the plants in optimum condition."
  },
  {
    "id": 6,
    "name": "Dwarf Umbrella",
    "botanical-name": "Schefflera Umbrella",
    "location": ["Stairs", "School Hall", "Old Canteen"],
    "info": "The Umbrella plant, Schefflera Arboricola, also known as the Dwarf umbrella tree is a popular indoor plant due to its ease of care and attractive appearance.They can grow with one trunk, but most likely with two or more and multiple branches displaying palmate compound or whorled leaves (like fingers coming from the stalk) with four to twelve leaflets or more, giving it an umbrella spoke appearance. The glossy leaflets are near oval-shaped, a few inches long, and a couple of inches wide (depending on the age and size of the tree)."
  },
  {
    "id": 7,
    "name": "Dumb Canes",
    "botanical-name": "Dieffenbachia",
    "location": ["Stairs", "Old Canteen", "Church"],
    "info": "The Dumb Cane plant is a strong species that will thrive in any light conditions other than direct sunlight. It’s easy to care for style and resilience to neglect to make it a wonderful house plant.. .Each plant features leaves that are yellow near their vein, abruptly turning a dark green toward the edge of the leaf. This transition is random, even within the same leaf, creating ribbons and spots of yellow and green along the leaf’s body."
  },
  {
    "id": 8,
    "name": "Longevity Spinach",
    "botanical-name": "Gynura procumbens",
    "location": ["Stairs"],
    "info": "Longevity spinach, also known as Gynura procumbens, is growing in popularity thanks to its benefits as green, leafy spinach! It is a veggie plant famous worldwide but primarily found in Africa, China, and Southeast Asia. It would thrive in areas that have tropical climates, being native in terrestrial, warm locations and habitats."
  },
  {
    "id": 9,
    "name": "Earth Star",
    "botanical-name": "Cryptanthus Acaulis",
    "location": ["Stairs"],
    "info": "Cryptanthus are part of the bromeliad plant family and native to Brazil. Despite the flat shape, these plants can reach up to two feet across.The leaves are wavy and feature a striped pattern.They are typically available in various shades of red, green, white, and pink.The earth star bromeliad can get quite big. When grown outdoors in ideal conditions, it can reach up to two feet across."
  },
  {
    "id": 10,
    "name": "Gold Dust Croton",
    "botanical-name": "Codiaeum Variegatum",
    "location": ["Stairs", "School Hall"],
    "info": "The Gold Dust Croton is known and loved for its bright and beautiful foliage. Its green leaves appear to have been dusted by gold, hence its name. It is a slow grower and does well when grouped together. This plant usually grows to about 3 feet high, making it easy to add to any space! The oil from the seeds is used to make medicine."
  },
  {
    "id": 11,
    "name": "Lemon Cypress",
    "botanical-name": "Cupressus macrocarpa",
    "location": ["School Hall"],
    "info": "Lemon Cypress also commonly referred to as the Goldcrest Monterey Cypress, Cupressus macrocarpa ‘Goldcrest’ (also known as Hesperocyparis macrocarpa) is a Monterey cypress cultivar with upward-growing branches. The unique yellow-green color of the lemon cypress can play off darker greens of other conifers, while texture can be experimented with by placing the shrub next to boulders and fencing."
  },
  {
    "id": 12,
    "name": "Shield Aralia",
    "botanical-name": "Polyscias Scutellaria",
    "location": ["School Hall"],
    "info": "Polyscias scutellaria commonly called Shield Aralia or Plum Aralia is an easy care evergreen tree-like plant which can grow to a height of about 6M and bears attractive round leaves.The variegated cultivars do best if located bright or part sunny with some morning, evening or winter sun. The green leaved forms will also tolerate light shade."
  },
  {
    "id": 13,
    "name": "Ming Aralia",
    "botanical-name": "Polyscias Fruticosa",
    "location": ["School Hall"],
    "info": "Native to the tropics of India and Polynesia, Ming aralia is an interesting and exotic houseplant that is technically an evergreen shrub. While it is a bit more temperamental to grow than your average plant, it's well worth the effort for its fluffy, bright green foliage. Its ferny, feathery leaves droop from graceful narrow branches that grow straight up, forming a many-layered, complex plant."
  },
  {
    "id": 14,
    "name": "Petra Croton",
    "botanical-name": "Codiaeum Variegatum",
    "location": ["School Hall"],
    "info": "Crotons are best grown in subtropical South and Central Florida. Frosts or freezes will damage them, but they quickly recover. When used outdoors this plant looks most attractive when grown in groups.Croton Petra is a gorgeous ornamental foliage plant with stunning leaf colour and variegation. The leaves tend to be glossy and oval in shape with pointed tips. Colours range from pink, through reds, oranges, yellows, light and dark greens - so much colour on one plant!"
  },
  {
    "id": 15,
    "name": "Philodendron",
    "botanical-name": "Philodendron",
    "location": ["Physics Lab"],
    "info": "The philodendron plant can remove pollutants like formaldehyde and clean the air. The plant's leaves are big enough that they absorb moisture and release it as clean oxygen into the room. he plants have large, green, dark leaves which allow them to absorb even the tiniest traces of light and water."
  },
  {
    "id": 16,
    "name": "Guava",
    "botanical-name": "Psidium Guajava ",
    "location": ["Physics Lab"],
    "info": "Guava is a tree that grows in Central and South America. The fruit is commonly eaten fresh or made into beverages, jams, and other foods. Various parts of the plant, including the leaf and the fruit, are used as medicine. People use guava leaf for stomach and intestinal conditions, pain, diabetes, and wound healing."
  },
  {
    "id": 17,
    "name": "Holy Basil",
    "botanical-name": "Ocimum Tenuiflorum",
    "location": ["Physics Lab"],
    "info": "Holy basil (Ocimum tenuiflorum) is a plant that is native to India. It is commonly used in the traditional Indian medicine system, Ayurveda. Holy basil is sometimes called 'hot basil' because of its peppery taste. Chemicals in holy basil are thought to decrease pain and swelling. Holy basil has been shown to boost your body's health in a variety of ways."
  },
  {
    "id": 18,
    "name": "Coleus",
    "botanical-name": "Plectranthus Scutellarioides",
    "location": ["Old Canteen", "Church"],
    "info": "Coleus is a genus of annual or perennial herbs or shrubs, sometimes succulent, sometimes with a fleshy or tuberous rootstock, found in the Old World tropics and subtropics. The relationship among the genera Coleus, Solenostemon and Plectranthus has been confused. Coleus and Solenostemon were sunk into Plectranthus, but recent phylogenetic analysis found Plectranthus to be paraphyletic with respect to other related genera in the subtribe Plectranthinae."
  },
  {
    "id": 19,
    "name": "Hibiscus",
    "botanical-name": "Hibiscus",
    "location": ["Old Canteen", "Basketball Court", "Church"],
    "info": "Hibiscus is a genus of flowering plants in the mallow family, Malvaceae. The genus is quite large, comprising several hundred species that are native to warm temperate, subtropical and tropical regions throughout the world. Member species are renowned for their large, showy flowers and those species are commonly known simply as 'hibiscus', or less widely known as rose mallow. Other names include hardy hibiscus, rose of sharon, and tropical hibiscus."
  },
  {
    "id": 20,
    "name": "Periwinkle",
    "botanical-name": "Periwinkle",
    "location": ["Old Canteen"],
    "info": "Periwinkle is a color in the blue and violet family. Its name is derived from the lesser periwinkle or myrtle herb (Vinca minor) which bears flowers of the same color. Periwinkle (color) Common connotations. serenity, peacefulness, femininity and comfort. It is an evergreen herb or an herbaceous under shrub, quite hardy, biennial or short lived perennial, up to 3 ft height."
  },
  {
    "id": 21,
    "name": "Garden Croton",
    "botanical-name": "Codiaeum Variegatum",
    "location": ["Old Canteen", "Church"],
    "info": "It is a tropical, evergreen, monoecious shrub growing to 3 m (9.8 ft) tall and has large, thick, leathery, shiny evergreen leaves, alternately arranged, 5–30 cm (2.0–11.8 in) long and 0.5–8 cm (0.20–3.15 in) broad. The leaf blades can, for example, be ruler-lanceolate, oblong, elliptic, lanceolate, ovate inverted, ovate spatulate, or violin-shaped and coloured green, yellow, or purple in various patterns, depending on the variety. The petiole has a length of 0.2 to 2.5 cm."
  },
  {
    "id": 22,
    "name": "Snake Plant",
    "botanical-name": "Dracaena Trifasciata",
    "location": ["Old Canteen"],
    "info": "It is an evergreen perennial plant forming dense strands, spreading by way of its creeping rhizome, which is sometimes above ground, sometimes underground. Its stiff leaves grow vertically from a basal rosette. Mature leaves are dark green with light gray-green cross-banding and usually range from 70–90 centimetres (2.3–3.0 ft) long and 5–6 centimetres (2.0–2.4 in) wide, though it can reach heights above 2 m (6 ft) in optimal conditions."
  },
  {
    "id": 23,
    "name": "Bush Lily",
    "botanical-name": "Clivia Miniata",
    "location": ["Old Canteen"],
    "info": "Clivia miniata, the Natal lily or bush lily, is a species of flowering plant in the genus Clivia of the family Amaryllidaceae, native to woodland habitats in South Africa (Eastern Cape, Mpumalanga and KwaZulu-Natal provinces) as well as in Eswatini. Given suitable conditions it grows into large clumps and is surprisingly water wise. It is also reportedly naturalized in Mexico."
  },
  {
    "id": 24,
    "name": "Tatsoi",
    "botanical-name": "Brassica Rapa",
    "location": ["Old Canteen"],
    "info": "Tatsoi (Brassica rapa subsp. narinosa or Brassica rapa var. rosularis) is an Asian variety of Brassica rapa grown for greens. Also called tat choy, it is closely related to the more familiar Bok Choy. This plant has become popular in North American cuisine as well, and is now grown throughout the world."
  },
  {
    "id": 25,
    "name": "Arabian Jasmine",
    "botanical-name": "Jasminum Sambac",
    "location": ["Old Canteen", "Church"],
    "info": "Jasminum sambac is a small shrub or vine growing up to 0.5 to 3 m (1.6 to 9.8 ft) in height. It is widely cultivated for its attractive and sweetly fragrant flowers. The flowers may be used as a fragrant ingredient in perfumes and jasmine tea. It is the national flower of the Philippines, where it is known as sampaguita, as well as being one of the three national flowers of Indonesia, where it is known as melati putih."
  },
  {
    "id": 26,
    "name": "Indonesian Bay Leaf",
    "botanical-name": "Syzygium Polyanthum",
    "location": ["Old Canteen"],
    "info": "Syzygium polyanthum, with common names Indonesian bay leaf or daun salam, is a species of plant in the family Myrtaceae, native to Indonesia, Indochina and Malaysia. The leaves of the plant are traditionally used as a food flavouring, and have been shown to kill the spores of Bacillus cereus."
  },
  {
    "id": 27,
    "name": "Caricature Plant",
    "botanical-name": "Gratophyllum Pictum",
    "location": ["Basketball Court"],
    "info": "Graptophyllum pictum, the caricature-plant, is a shrub in the family Acanthaceae. It is native to New Guinea, also a well-known garden shrub. There are two varieties: the variegated color one is known as 'white adulsa', and is used combined with coconut water to reduce swelling. The dark-leaved variety is known with trade name 'black adulsa' in India."
  },
  {
    "id": 28,
    "name": "Oleandar",
    "botanical-name": "Nerium Oleander",
    "location": ["Church"],
    "info": "Nerium oleander, most commonly known as oleander or nerium, is a shrub or small tree cultivated worldwide in temperate and subtropical areas as an ornamental and landscaping plant. It is the only species currently classified in the genus Nerium, belonging to subfamily Apocynoideae of the dogbane family Apocynaceae. It is so widely cultivated that no precise region of origin has been identified, though it is usually associated with the Mediterranean Basin."
  },
  {
    "id": 29,
    "name": "Daisy",
    "botanical-name": "Bellis Perennis",
    "location": ["Church"],
    "info": "Bellis perennis is a perennial herbaceous plant growing to 20 centimetres (8 inches) in height. It has short creeping rhizomes and rosettes of small rounded or spoon-shaped leaves that are from 2 to 5 cm (3⁄4–2 in) long and grow flat to the ground. The species habitually colonises lawns, and is difficult to eradicate by mowing, hence the term 'lawn daisy'. It blooms from March to September and exhibits the phenomenon of heliotropism, in which the flowers follow the position of the sun in the sky."
  },
  {
    "id": 30,
    "name": "Song Of India",
    "botanical-name": "Dracaena Reflexa",
    "location": ["Church"],
    "info": "Song of India (Dracaena reflexa) is a tropical tree native to islands of the Indian ocean, including Mozambique, Madagascar, and Mauritius. This popular plant can be grown indoors, and thanks to its easy growth habits.It has alternating dark green and chartreuse stripes on narrow, lanceolate leaves with veins that run parallel along their length. These leaves are in a whorled arrangement, gradually dying off to reveal a stem with an interesting pattern."
  },
  {
    "id": 31,
    "name": "Red Jasmine",
    "botanical-name": "Plumeria Rubra",
    "location": ["Church"],
    "info": "Jasminum are evergreen or deciduous shrubs, many climbing by twining stems bearing usually pinnate leaves, and star-shaped white, pink or yellow flowers, which are sometimes very fragrant. Fruit a black berry. Best grown in fertile, well drained sun in full sun or partial shade, in a sheltered postion. Will tolerate most soil types. Deciduous in cold areas."
  },
  {
    "id": 32,
    "name": "Papaya",
    "botanical-name": "Carica papaya",
    "location": ["Church"],
    "info": "The papaya is a small, sparsely branched tree, usually with a single stem growing from 5 to 10 m (16 to 33 ft) tall, with spirally arranged leaves confined to the top of the trunk. The lower trunk is conspicuously scarred where leaves and fruit were borne. The leaves are large, 50–70 cm (20–28 in) in diameter, deeply palmately lobed, with seven lobes. All plant parts contain latex in articulated laticifers."
  },
  {
    "id": 33,
    "name": "Mango",
    "botanical-name": "Mangifera Indica",
    "location": ["Church"],
    "info": "Mango trees grow to 30–40 metres (98–131 feet) tall, with a crown radius of 10–15 m (33–49 ft). The trees are long-lived, as some specimens still fruit after 300 years.The ripe fruit varies according to cultivar in size, shape, color, sweetness, and eating quality.Depending on the cultivar, fruits are variously yellow, orange, red, or green.The fruit has a single flat, oblong pit that can be fibrous or hairy on the surface and does not separate easily from the pulp."
  },
  {
    "id": 34,
    "name": "Peregrina",
    "botanical-name": "Jatropha Integerrima",
    "location": ["Church"],
    "info": "Peregrina is an evergreen shrub or small tree, with glossy leaves and clusters of star shaped red, pink or vermilion flowers. The plant has a rounded or narrow domed form and grows up to 15 ft tall with a spread of about 10 ft. In cultivation, however. it is usually smaller. Peregrina most often grows shrub-like with several slender trunks, but it can also be pruned into to a single trunk. The leaves are very variable, up to 7 inches long."
  },
  {
    "id": 35,
    "name": "Painter's Palette",
    "botanical-name": "Anthurium Andraeanum",
    "location": ["Church"],
    "info": "A lot of indoor plants are listed as air-purifying and stress-reliever plants. Such a plant is Anthurium Andraeanum. It is also known as a painter’s palette and flamingo lily. This bright floral tree is beneficial too. So, if you are ready to adopt this tree as your indoor plant, then in this article, you can find some significant features of the Anthurium Andraeanum or the painter’s palette."
  },
  {
    "id": 36,
    "name": "Dinner Plate Aralia",
    "botanical-name": "Polyscias Balfouriana",
    "location": ["School Hall"],
    "info": "An Aralia is an evergreen plant native to Africa, Asia, Australia, parts of North and Central America, and South America. The distinct leaves of a Dinner Plate Aralia resemble leathery, round, dinner plates about 1-2 inch in diameter, which is how the plant got its nickname, the Dinner Plate Aralia. The leaves can range in color from light green to dark green and some varieties have green and cream colored variegated leaves."
  },
  {
    "id": 37,
    "name": "Banyan Tree",
    "botanical-name": "Ficus Benghalensis",
    "location": ["Stairs"],
    "info": "A banyan, also spelled 'banian', is a fig that develops accessory trunks from adventitious prop roots, allowing the tree to spread outwards indefinitely. This distinguishes banyans from other trees with a strangler habit that begin life as an epiphyte i.e. a plant that grows on another plant, when its seed germinates in a crack or crevice of a host tree or edifice.Like other fig species, banyans bear their fruit in the form of a structure called a 'syconium'. The syconium of Ficus species supply shelter and food for fig wasps and the trees depend on the fig wasps for pollination."
  }
]
